package com.company.practice3.game.gui;

public class ASCIIart {

    public static String[] baseAnimation = {
            "         ((((\n" +
            "        ((((\n" +
            "         ))))\n" +
            "      _ .---.\n" +
            "     ( |`---'|\n" +
            "      \\|     |\n" +
            "      : .___, :\n" +
            "       `-----'\n" +
            "персонаж набирается сил\n" +
            " для будущих свершений",

            "        ))))\n" +
            "         ((((\n" +
            "        ((((\n" +
            "      _ .---.\n" +
            "     ( |`---'|\n" +
            "      \\|     |\n" +
            "      : .___, :\n" +
            "       `-----'\n" +
            "персонаж набирается сил\n" +
            " для будущих свершений"
    };

    public static String autoExpedition =
            "            \n" +
            "           \n" +
            "            \n" +
            "     _ .---.\n" +
            "    ( |`---'|\n" +
            "     \\|     |\n" +
            "     : .___, :\n" +
            "      `-----'\n\n" +
            "ушел в автоэкспедицию";
}
