package com.company.practice3.game.gui

object AsciiArt {
    @JvmField
    val baseAnimation = arrayOf(
"""         ((((
        ((((
         ))))
      _ .---.
     ( |`---'|
      \|     |
      : .___, :
       `-----'
персонаж набирается сил
 для будущих свершений""",
"""        ((((
       ((((
        ))))
      _ .---.
     ( |`---'|
      \|     |
      : .___, :
       `-----'
персонаж набирается сил
 для будущих свершений"""
    )
    const val autoExpedition =
"""            
           
            
      _ .---.
     ( |`---'|
      \|     |
      : .___, :
       `-----'
 ушел в автоэкспедицию 
 """
    const val death =
"""
      ______
   .-"      "-.
  /            \
 |              |
 |,  .-.  .-.  ,|
 | )(__/  \__)( |
 |/     /\     \|
 (_     ^^     _)
  \__|IIIIII|__/
   | \IIIIII/ |
   \          /
    `--------`


 
"""
}